{
    "desc": "<p>An action the user has requested the text input control to perform.<\/p>\n<p>Each action represents a logical meaning, and also configures the soft\nkeyboard to display a certain kind of action button. The visual appearance\nof the action button might differ between versions of the same OS.<\/p>\n<p>Despite the logical meaning of each action, choosing a particular\n<a href=\"services\/TextInputAction-class.html\">TextInputAction<\/a> does not necessarily cause any specific behavior to\nhappen. It is up to the developer to ensure that the behavior that occurs\nwhen an action button is pressed is appropriate for the action button chosen.<\/p>\n<p>For example: If the user presses the keyboard action button on iOS when it\nreads \"Emergency Call\", the result should not be a focus change to the next\nTextField. This behavior is not logically appropriate for a button that says\n\"Emergency Call\".<\/p>\n<p>See <a href=\"widgets\/EditableText-class.html\">EditableText<\/a> for more information about customizing action button\nbehavior.<\/p>\n<p>Most <a href=\"services\/TextInputAction-class.html\">TextInputAction<\/a>s are supported equally by both Android and iOS.\nHowever, there is not a complete, direct mapping between Android's IME input\ntypes and iOS's keyboard return types. Therefore, some <a href=\"services\/TextInputAction-class.html\">TextInputAction<\/a>s\nare inappropriate for one of the platforms. If a developer chooses an\ninappropriate <a href=\"services\/TextInputAction-class.html\">TextInputAction<\/a> when running in debug mode, an error will be\nthrown. If the same thing is done in release mode, then instead of sending\nthe inappropriate value, Android will use \"unspecified\" on the platform\nside and iOS will use \"default\" on the platform side.<\/p>\n<p>See also:<\/p>\n<ul>\n<li>\n<a href=\"services\/TextInput-class.html\">TextInput<\/a>, which configures the platform's keyboard setup.<\/li>\n<li>\n<a href=\"widgets\/EditableText-class.html\">EditableText<\/a>, which invokes callbacks when the action button is pressed.<\/li>\n<\/ul>",
    "dtype": "enum",
    "example": "",
    "href": "services\/TextInputAction-class.html",
    "isAbstract": false,
    "isConstant": "0",
    "isDeprecated": false,
    "is_enum": 1,
    "is_mixin": 1,
    "is_typedef": 1,
    "memberOf": "services",
    "name": "services.TextInputAction",
    "shortname": "TextInputAction",
    "extends": [],
    "realImplementors": [],
    "events": [],
    "methods": [],
    "props": []
}